[
  {
    "year": 2017,
    "comment": "If you are looking for a growing career and want to stand aloft the crowd then Chandigarh University is a perfect place for you. The world class facilities in the CU campus, had given me chance to empower myself in every aspect. CU environment is filled with positive vibes for not only Indian students, but anyone from the world can easily adapt to this place.",
    "imgsrc": "/testimonials/img/Abhishek-Anand.jpg",
    "author": "Abhishek Anand, EEE",
    "placed": "Placed in MindTree",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "I am placed in WALT DISNEY, USA, the happiest place in the World and I owe my success to Chandigarh University. I was groomed to be a professional hospitality manager from day one and the university offered plethora of opportunities in terms of internships, expert interactions and global exposure to shape my career.",
    "imgsrc": "/testimonials/img/Shreya-Sachdeva.jpg",
    "author": "Shreya Sachdeva",
    "placed": "Selected in WALT DISNEY, USA ",
    "rating": 4.7
  },
  {
    "year": 2017,
    "comment": "I am lucky to have chosen CU as my place to study, I have had internship with Walt Disney and they have offered me a year extension to work with them. I am also placed in companies like Grand Hyatt, Vistara, CU has created a holistic environment where they have delivered more than any student’s expectation. Management is exceptional and is not only providing education and placements but giving us exemplary opportunities to have global careers.",
    "imgsrc": "/testimonials/img/Rajpreet-Garahe.jpg",
    "author": "Rajpreet Garahe",
    "placed": "Selected in WALT DISNEY, USA ",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "I know what I’m after, plus I know my strengths and with the collaboration of Chandigarh University and IBM, I think a new door of possibilities and opportunities is waiting for me.",
    "imgsrc": "/testimonials/img/Adarsh-Chauhan.jpg",
    "author": "Adarsh Chauhan, B.E. CSE (IBM)",
    "placed": "",
    "rating": 4.9
  },
  {
    "year": 2017,
    "comment": "I grew up on the inspirational feeds of great people like Elon Musk, Howard Hughes, Steve Jobs and only thing I found common was that - The field of your work doesn't really matter as long as it is doing the job of innovation and simultaneously solving people's problems.",
    "imgsrc": "/testimonials/img/Vinit-Bhamare.jpg",
    "author": "Vinit Bhamare",
    "placed": "B.E. – Aerospace Engineering &amp; Budding Entrepreneur",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "I didn't expect that I would get a placement in the first year itself. It's like a dream come true for me",
    "imgsrc": "/testimonials/img/vivek-sharma-18.jpg",
    "author": "Vivek Sharma, UILS",
    "placed": "Placed in Ministers of Power and Chief Minister's Office UP ",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "Chandigarh University is one of the largest ambiences, which has widest culture &amp; diversity",
    "imgsrc": "/testimonials/img/ruponita-18.jpg",
    "author": "Ruponita, UILS",
    "placed": "Placed in North Eastern Electrical Power Corporation Ltd (NEEPCO) ",
    "rating": 4.8
  },
  {
    "year": 2017,
    "comment": "If I had not been at Chandigarh University, my life would have been totally different",
    "imgsrc": "/testimonials/img/supriya-bhatt-18.jpg",
    "author": "Supriya Bhatt, IBM (Cloud Computing)",
    "placed": "Placed in MindTree ",
    "rating": 4.9
  },
  {
    "year": 2017,
    "comment": "Faculty at CU is not only supportive, but they put in a lot of efforts on each and every student",
    "imgsrc": "/testimonials/img/naman-sharma-18.jpg",
    "author": "Naman Sharma, ME",
    "placed": "Placed in Eveready Industries India Ltd ",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "CU has facilitated me with an opportunity to learn in a dynamic environment",
    "imgsrc": "/testimonials/img/udit-sareen-18.jpg",
    "author": "Udit Sareen, IMB (Big Data &amp; Analytics)",
    "placed": "Placed in Wipro | Deloitte | TCS ",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "When I came to CU, I was an introvert person and could not speak in front of people, but Chandigarh University has enriched me beyond what I believed possible.",
    "imgsrc": "/testimonials/img/ankit-arora-18.jpg",
    "author": "Ankit Arora",
    "placed": "Placed Student at Amazon  ",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "The exposure and facilities provided by Chandigarh University are sufficient enough to carry out promising research",
    "imgsrc": "/testimonials/img/akash-kumar-mishra-18.jpg",
    "author": "Akash Kumar Mishra, MSc Biotechnology",
    "placed": "Placed in Roots Analysis ",
    "rating": 4.8
  },
  {
    "year": 2017,
    "comment": "My journey at CU has been glorious throughout. I have experienced a lot new things and gained a plethora of knowledge",
    "imgsrc": "/testimonials/img/anita-jhapa-18.jpg",
    "author": "Anita Jhapa (ECE)",
    "placed": "Placed in global workforce company - Net2Source ",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "Being at CU was being under the exposure of research projects, internships, national international conferences and more",
    "imgsrc": "/testimonials/img/anshul-bansa-18.jpg",
    "author": "Anshul Bansal, MSc Biotechnology",
    "placed": "Placed in Omics International ",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "I really appreciates Chandigarh University for giving me enough opportunities to stand out.",
    "imgsrc": "/testimonials/img/ayush-sharma-18.jpg",
    "author": "Ayush Sharma",
    "placed": "Placed with VA Tech Ventures Pvt Ltd ",
    "rating": 4.9
  },
  {
    "year": 2017,
    "comment": "Chandigarh University has helped me discover myself",
    "imgsrc": "/testimonials/img/divyam-kumar-18.jpg",
    "author": "Divyam Kumar Sharma, Civil Engineering",
    "placed": "Placed in DHFL  ",
    "rating": 4.8
  },
  {
    "year": 2017,
    "comment": "It has been a wonderful experience at CU until now. The day I joined in, I had a lot of energy and passion but I was blank about where to go and what to do. CU has effectively acted as a pathfinder for me.",
    "imgsrc": "/testimonials/img/girish-mehta-18.jpg",
    "author": "Girish Mehta, CSE",
    "placed": "Placed in Sapient| IBM | ITC Infotech ",
    "rating": 4.9
  },
  {
    "year": 2017,
    "comment": "Having the opportunity to study at CU is something that offered me a real-time platform to employ the theoretical concepts and practical skills",
    "imgsrc": "/testimonials/img/lohit-18.jpg",
    "author": "Lohit Gaurav, EEE",
    "placed": "Placed in Scope International Pvt Ltd ",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "From the very first day, CU has kept us in a competitive environment. We were imparted with requisite skills such as aptitude, technical and soft skills that are demanded by the companies.",
    "imgsrc": "/testimonials/img/mayank-sood-18.jpg",
    "author": "Mayank Sood, CSE (Big Data)",
    "placed": "Placed in Deloitte ",
    "rating": 4.8
  },
  {
    "year": 2017,
    "comment": "I would like to take an opportunity to thank Chandigarh University for bringing Microsoft to the campus. Looking back, I can see CU as an extremely important stepping-stone in my career. Apart from academia, it allowed me to develop additional skills, which are extremely important in the world of work.",
    "imgsrc": "/testimonials/img/shivya-18.jpg",
    "author": "Shivya Bathla, BE- CSE",
    "placed": "Placed in Microsoft ",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "Getting placed in Microsoft is a really big thing for me as I come from a place where the majority of people even don't know about the company. It's the constant guidance, valuable support and faculty of Chandigarh University that has let me grab such an amazing opportunity.",
    "imgsrc": "/testimonials/img/preeti-18.jpg",
    "author": "Preeti Singh Manhas, BE- CSE (Cloud Computing)",
    "placed": "Placed in Microsoft ",
    "rating": 4.5
  },
  {
    "year": 2017,
    "comment": "First of all, heartiest thanks to CU for bringing numerous top notch companies to the campus. I got placed in Microsoft with a decent package. When I joined CU, I was a mere teenager who had no plans for a career. However, Chandigarh University in a couple of years has enriched me beyond what I believed possible.",
    "imgsrc": "/testimonials/img/pranav-18.jpg",
    "author": "Pranav Salathia, BE- CSE",
    "placed": "Placed in Microsoft",
    "rating": 4.9
  },
  {
    "year": 2017,
    "comment": "Getting placed in the Microsoft was something I always wished for and Chandigarh University has made it true. I came to this university because it provides ample opportunities that one can get nowhere else. My message to my junior counterparts is - Have faith in CU and follow the necessary procedures; it will definitely help you turn your dreams into reality.",
    "imgsrc": "/testimonials/img/pardeep-kaur-18.jpg",
    "author": "Pardeep Kaur Saggu, BE- CSE",
    "placed": "Placed in Microsoft",
    "rating": 4.8
  },
  {
    "year": 2017,
    "comment": "If I could describe my experience at Chandigarh University in a single word, it would be wonderful. The opportunity to sit in Microsoft Placement drive and grab a placement came my way only because of Chandigarh University. I feel I have grown better as a person and gained improved perspective into the world-of-work.",
    "imgsrc": "/testimonials/img/diksha-18.jpg",
    "author": "Diksha, BE- CSE",
    "placed": "Placed in Microsoft",
    "rating": 4.7
  },
  {
    "year": 2017,
    "comment": "Since childhood, I was not much interested in studies. Also before coming to CU, I was not familiar with what exactly placements are. However, the motivation and grooming of CU has helped me get placement in leading company like Amazon.",
    "imgsrc": "/testimonials/img/lakshy-18.jpg",
    "author": "Lakhya Sharma, BE- CSE",
    "placed": "Placed in Amazon Web Services",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "CU has imparted me with nth capabilities to fulfill aspirations of my parents. Big thanks to all the faculties, DCD trainers and management of Chandigarh University.",
    "imgsrc": "/testimonials/img/vishal-18.jpg",
    "author": "Vishal Gupta,- CSE",
    "placed": "Placed in Amazon Web Services",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "Getting placed in a good company has always been my dream and Chandigarh University has made it true. I got placed in Amazon Web Services. Thanks to the faculties, and Training and Placement Department without whose help this would not have been possible.",
    "imgsrc": "/testimonials/img/Rishab-Gupta.jpg",
    "author": "Rishab Gupta, BE- CSE",
    "placed": "Placed in Amazon Web Services",
    "rating": 4.5
  },
  {
    "year": 2017,
    "comment": "CU had played a vital role in making me corporate ready. The faculty, management, and Training &amp; Placement department of CU always ensure that their students get placed in the best companies.",
    "imgsrc": "/testimonials/img/Abhinandhan.jpg",
    "author": "Abhinandhan, MBA",
    "placed": "Placed in Just Dial",
    "rating": 4.9
  },
  {
    "year": 2017,
    "comment": "Training and Placement Department of Chandigarh University has helped me grab the placement offer of Amazon Web Services. Being in CU, I have not only developed my academic skills, but also got an exposure to the range of hands-on challenges.",
    "imgsrc": "/testimonials/img/akash-18.jpg",
    "author": "Aakash, BE- CSE",
    "placed": "Placed in Amazon Web Services",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "Starting from day one, my experiencing at Chandigarh University was amazing. I got a chance to learn a lot many things and interact with people from around the globe. Learning at CU was difference experience; it changed my overall personality and made me more confident.",
    "imgsrc": "/testimonials/img/Ankush.jpg",
    "author": "Ankush",
    "placed": "IndusInd bank",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "I am very thankful to Chandigarh University for giving wings to my career. The Faculty here is very co-operative and always ready to help. Without the persistent efforts to Training &amp; Placement Department, I would not have been able to grab this placement. Last but not the least, a special thank to CU Management for bringing a plethora of companies to the campus.",
    "imgsrc": "/testimonials/img/Archna.jpg",
    "author": "Archna",
    "placed": "HDFC Bank",
    "rating": 4.5
  },
  {
    "year": 2017,
    "comment": "Chandigarh University changed my life completely. While pursuing my course, I was unsure whether I would be able to grab placement or not. But, the stupendous support of my faculty and TPP trainers helped me grab one. Now, I will be shortly joining Tommy Hilfiger as a CRO and I am really happy for this.",
    "imgsrc": "/testimonials/img/Ayushi.jpg",
    "author": "Ayushi",
    "placed": "Tommy Hilfiger",
    "rating": 4.9
  },
  {
    "year": 2017,
    "comment": "Chandigarh University is a great platform to enhance your skills. It not only restricts students to study but also allow indulging in a myriad of extra-curricular activities. All you need to do at CU is some hard work with smart work and success will be all yours.",
    "imgsrc": "/testimonials/img/Divyanshi.jpg",
    "author": "Divyanshi, MBA",
    "placed": "HDFC Bank",
    "rating": 4.5
  },
  {
    "year": 2017,
    "comment": "In an era of humongous data, companies look for professionals who are hands-on with Big Data. Chandigarh University is one among the very few universities that offers new age MBA course in Business Analytics.",
    "imgsrc": "/testimonials/img/Manpreet-Kaur.jpg",
    "author": "Manpreet Kaur",
    "placed": "HDFC Bank",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "My journey at Chandigarh University has been tremendously fruitful. It has provided me with intensive learning, career development as well as personality development.",
    "imgsrc": "/testimonials/img/Mehak-Verma.jpg",
    "author": "Mehak Verma",
    "placed": "HDFC Bank",
    "rating": 4.8
  },
  {
    "year": 2017,
    "comment": "Department of Career Development at Chandigarh University has been very supportive throughout the journey. My experience at Chandigarh University has been very good. I see myself as a totally transformed person now.",
    "imgsrc": "/testimonials/img/Mir-Maria.jpg",
    "author": "Mir Maria",
    "placed": "Jaro Education",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "Chandigarh University is a place where you can find a perfect amalgamation of learning, research, fun, cultural diversity and other life preaching activities. I am truly thankful to Training &amp; Placement Department of CU for providing me a platform to enhance my skills and a podium to showcase them.",
    "imgsrc": "/testimonials/img/Parmpal-Singh.jpg",
    "author": "Parmpal Singh",
    "placed": "HDFC Bank",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "I would like to extend my sincere gratitude to the Training &amp; Placement Department and the entire faculty of Chandigarh University for putting in their efforts in imparting quality education and aptitude training.",
    "imgsrc": "/testimonials/img/Pardeep-Kumar.jpg",
    "author": "Pardeep Kumar",
    "placed": "IndusInd Bank",
    "rating": 4.5
  },
  {
    "year": 2017,
    "comment": "It was a great time I spent in Chandigarh University. CU has amazing and cooperative faculty and campus environment is extremely positive. Training and Placement department has also been very helpful throughout the training episode.",
    "imgsrc": "/testimonials/img/Priyanka.jpg",
    "author": "Priyanka",
    "placed": "Justdial",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "Studying MBA in Chandigarh University has widened my perspective and has given me an idea of the professional world that too during the academics simultaneously.",
    "imgsrc": "/testimonials/img/Rahul-Patyal.jpg",
    "author": "Rahul Patyal, MBA",
    "placed": "Justdial",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "Chandigarh University as a whole has given us an opportunity to work with IBM trainers. Working on various softwares sourced from IBM has better helped us understand the IT market intricacies and challenging market trends.",
    "imgsrc": "/testimonials/img/Ritvik-Sharma.jpg",
    "author": "Ritvik Sharma",
    "placed": "HDFC",
    "rating": 4.9
  },
  {
    "year": 2017,
    "comment": "I can certainly say Chandigarh University has made me a better person. It has helped me develop a positive attitude and discover more about myself. Teachers here are very supportive. Big thanks to Chandigarh University.",
    "imgsrc": "/testimonials/img/Rohan-Agarwal.jpg",
    "author": "Rohan Agarwal",
    "placed": "HDFC",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "Chandigarh University has actually boosted my confidence. Now I am even more confident to face the crowd. Shifting from academics to professional life - it has been a fantastic journey for me.",
    "imgsrc": "/testimonials/img/Saima.jpg",
    "author": "Saima",
    "placed": "Khanna Paper Mills",
    "rating": 4.9
  },
  {
    "year": 2017,
    "comment": "At Chandigarh University, it's really nice to see high a degree of professionalism whether its academics, preparing students for jobs or higher studies.",
    "imgsrc": "/testimonials/img/Shagun-Tripathi.jpg",
    "author": "Shagun Tripathi",
    "placed": "Zycus Infotech",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "My experience at Chandigarh University has been more than my expectation. Pursuing an industry sponsored MBA in Banking &amp; Financial Engineering has helped me learn so many things and softwares such as Tally, FLIP and more, which were demanded at HDFC.",
    "imgsrc": "/testimonials/img/Shaifali.jpg",
    "author": "Shaifali",
    "placed": "HDFC Bank",
    "rating": 4.8
  },
  {
    "year": 2017,
    "comment": "I was expecting an internship by the end of my MBA course but Chandigarh University has provided me a chance to take up internship in the first semester itself - this is a matter of immense pleasure for me.",
    "imgsrc": "/testimonials/img/Shristi-Bhardwaj.jpg",
    "author": "Shristi Bhardwaj",
    "placed": "HDFC Bank",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "I was very nervous as it was my first interview, but everything flew smoothly. Chandigarh University is a good platform to make new friends, learn new things and new languages as well. Along with academics, CU has also honed my overall personality by providing numerous extracurricular platforms as well.",
    "imgsrc": "/testimonials/img/Sonal-Pandita.jpg",
    "author": "Sonal Pandita",
    "placed": "Tommy Hilfiger",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "I choose Chandigarh University for my studies in master. This university has provided me the platform to explore my abilities and skills beyond my expectations.",
    "imgsrc": "/testimonials/img/Varun-Raj.jpg",
    "author": "Varun Raj Sharma",
    "placed": "HDFC Bank",
    "rating": 4.9
  },
  {
    "year": 2017,
    "comment": "I found the decision to study in Chandigarh University as one among the best of my life. Experienced faculties, approachable management and extensive practical exposure are the assets of this university that have helped us all through.",
    "imgsrc": "/testimonials/img/Yamini-Panta.jpg",
    "author": "Yamini Panta",
    "placed": "HDFC Bank",
    "rating": 4.9
  },
  {
    "year": 2017,
    "comment": "Now, I can proudly say that I am a Microsoft Intern - this is really more than I could ever imagine. Thanks to Chandigarh University. It has helped me to grow as a Thinker.",
    "imgsrc": "/testimonials/img/sai-teja-18.jpg",
    "author": "Sai Teja, BE- CSE",
    "placed": "Placed in Microsoft",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "CU has led me to the path of success by effective nurturing and motivation. The world-of-work is extremely different from academics, but CU has groomed me in such a way that I can easily take up any challenges thrown upon me.",
    "imgsrc": "/testimonials/img/Kehar-Singh.jpg",
    "author": "Kehar Singh",
    "placed": "HDFC Bank",
    "rating": 4.9
  },
  {
    "year": 2017,
    "comment": "CU has provided me with the opportunity to live my dream of Working at Microsoft. Heartiest thanks to CU...",
    "imgsrc": "/testimonials/img/priyanka-18.jpg",
    "author": "Priyanka Tiwari, BE- CSE",
    "placed": "Placed in Microsoft",
    "rating": 5
  },
  {
    "year": 2017,
    "comment": "My experience throughout my journey at Chandigarh University was very remarkable. I really enjoyed the atmosphere and learning culture provided by the University. I have learned a lot from faculty and peers as well. Huquo was the second company that visited campus for our batch and I was the only one in the department to grab the placement. On that particular day, I realized that it was the knowledge and positive attitude induced by CU that made me able to crack the interview.",
    "imgsrc": "/testimonials/img/AyuSrivastav.jpg",
    "author": "Ayu Srivastav, MBA",
    "placed": "Huquo",
    "rating": 4.8
  },
  {
    "year": 2016,
    "comment": "Being selected in Microsoft like dream come true and my complete credit goes to team CU. Although I was, a meritorious student but I never hoped I will be able to crack Microsoft in first attempt itself. I am over this moon",
    "imgsrc": "/testimonials/img/aditya-kumar.jpg",
    "author": "Aditya Kumar",
    "placed": "Selected in Microsoft",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "Today I stand among my peers and my parents couldn’t be prouder. Being in CU is not just about placement but overall transformation into a professional and confident human being to lead the life.",
    "imgsrc": "/testimonials/img/kumar-kartik.jpg",
    "author": "Kumar kartik",
    "placed": "Selected in Tech Mahindra",
    "rating": 4.9
  },
  {
    "year": 2016,
    "comment": "I owe my success today to university management who have created brilliant platform for students to get platform to placed in their dream companies.CU is wholesale community that’s gives you an amazing atmosphere to be a better professional and a person.",
    "imgsrc": "/testimonials/img/karan-virdi.jpg",
    "author": "Karan Virdi",
    "placed": "Selected in Mu sigma",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "CU offers global level education and has created a great platform for students who wish to further their carrier with international organizations. Faculty and trainee are flexible and effective in academics allow us to pursue our passion. Engineering at CU is synonym to success in life.",
    "imgsrc": "/testimonials/img/vasu-narang.jpg",
    "author": "Vasu Narang",
    "placed": "Selected in Amazon India pvt.ltd",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "Being in CU was the most apt thing for me, apart from excellent faculty I got to work closely with experts who are actively engaged in chemical field. University emphasizes a great deal on experiential learning and project work. It’s just amazing feeling to select three core companies.",
    "imgsrc": "/testimonials/img/simmi-sharma.jpg",
    "author": "Simmi Sharma",
    "placed": "Selected in Galaxy Surfactants",
    "rating": 4.5
  },
  {
    "year": 2016,
    "comment": "I am placed international in a core company and it has been as amazing experience. I am from Gujarat and it was great journey at university being with students from so many states. I am focused, confident and ready to explore the world.",
    "imgsrc": "/testimonials/img/neel-chauhan.jpg",
    "author": "Neel Chauhan",
    "placed": "Selected in Mt. Meru Group",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "CU’s faculty and carrier development team motivated me to go beyond my limits, apart from technical aspects they made me aware of cognitive and attitude approaches, which play crucial role during placements. My parents and I are super excited. ",
    "imgsrc": "/testimonials/img/gurpreet-caur.jpg",
    "author": "Gurpreet kaur",
    "placed": "Selected in Thoughtworks Technologies",
    "rating": 4.8
  },
  {
    "year": 2016,
    "comment": "CU offers a completely flexible model of learning which allows us to specialize in futuristic technologies. We are not restricted to just one two companies but allow experiencing placement for both core and allied streams. CU is a new age which believes in offering unlimited opportunities.",
    "imgsrc": "/testimonials/img/akshit-verma.jpg",
    "author": "Akshit Verma",
    "placed": "Selected in Hewlett Packard",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "The support for students at the Business School is fantastic. Many of the teaching staff have spent a considerable amount of time in industry before deciding to enter academia, meaning they not only have practical experience and first hand examples but also interesting anecdotes to share! ",
    "imgsrc": "/testimonials/img/mahenoor.jpg",
    "author": "Mahenoor",
    "placed": "Selected in Bhasin Group",
    "rating": 4.9
  },
  {
    "year": 2016,
    "comment": "In my opinion, the University School of Business is where you need to be if you want to understand the realities and practicalities of what goes on in the world of finance. It is an amazing place with a very conducive learning environment. It is also one of the best universities in India ",
    "imgsrc": "/testimonials/img/shrey-pokhriyal.jpg",
    "author": "Shrey Pokhriyal",
    "placed": "Selected in Ujjivan Finance",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "Chandigarh University is the best concerning learning, experience and gaining exposure to fields relevant to my discipline, all due to my faculty members. Their continuous efforts in getting the right companies for the right candidates, have truly redefined our careers. This endeavor will lead our University to incredible heights.",
    "imgsrc": "/testimonials/img/aditi-sharma.jpg",
    "author": "Aditi Sharma",
    "placed": "Selected in Jaro Education",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "In the past 1 year, I had countless opportunities to develop analytical skills, leadership and proactive thinking through various programs and events. These attributes were the key reasons because of which I was successfully selected by Nestle as an Intern. Big thanks to all my faculty and friends for the amazing journey at Chandigarh University.",
    "imgsrc": "/testimonials/img/rajesh-kumar.jpg",
    "author": "Rajesh Kumar",
    "placed": "Selected in Nestle India Ltd.",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "The best thing about studying at the Business School is being in an environment that encourages   independent learning and critical thinking, and is also a really beautiful place to live. You have everything you need in one location and the facilities are top notch. I am thankful to management for such good opportunities.",
    "imgsrc": "/testimonials/img/anish-narula.jpg",
    "author": "Anish Narula",
    "placed": "Selected in TPG Global",
    "rating": 4.5
  },
  {
    "year": 2016,
    "comment": "The most important thing for any engineering student is learning and I must say that overall experience at CU is at par with best institutes of India. We were involved in numerous projects from the first semester onward which enhances the analytical approach towards the subject. This real time preparation makes us ready for professional journey.",
    "imgsrc": "/testimonials/img/aastha-malhotra.jpg",
    "author": "Aastha Malhotra",
    "placed": "CSE",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "Before I joined the university I had lot of ambiguities about which path to take, how to prepare myself for the profession, how to make the most of my talents. Department of Career Development and my technical faculty helped me in preparing myself for the upcoming challenges. Today I am placed in two companies and I am elated with the choice I made 4 years back.",
    "imgsrc": "/testimonials/img/arindam-taak.jpg",
    "author": "Arindam Taak",
    "placed": "ECE",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "I chose CU because of the placements it offers, it won’t be wrong to say that they have the robust structure when it comes to industry. Corporate Resources Center along with the Department of Career Development made it possible for me to have the opportunity and get placed in the company of my choice. CU is undisputable leader that prepares its students for any challenge.",
    "imgsrc": "/testimonials/img/kunwar-bharat-singh.jpg",
    "author": "Kunwar Bharat Singh",
    "placed": "ECE",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "USB shaped me from the day one to face the corporate world. The environment in the department has taught me to be innovative and meticulous in approach to any strategic goals set for a professional. Whether the work scope is within domain of expertise or not, a proper approach can solve all issues in hand. It was the support of my teachers/ mentors which motivated me to THINK BIG &amp; ACHIEVE BIG",
    "imgsrc": "/testimonials/img/gunjita-kashyap.jpg",
    "author": "Gunjita Kashyap",
    "placed": "Selected in HDFC Bank",
    "rating": 4.9
  },
  {
    "year": 2016,
    "comment": "Placements is the big question among aspiring engineers. CU not only offers placements but assures the quality of company students are being placed in. Before placements the first step is the mentoring by industry leaders, which is a unique aspect of CU. I saw my seniors getting placed in top notch companies and that made me feel confident that I will have the same opportunities. I must say CU is doing much more than just placing the students, they are making them industry relevant professionals.",
    "imgsrc": "/testimonials/img/rohan-arora.jpg",
    "author": "Rohan Arora",
    "placed": "CSE",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "CU has given me more than what I had expected, I got a great platform to explore various avenues of a rich student life. From extra- curricular activities to research, CU offers a bouquet of opportunities to its students. CU takes you to a different level of education.",
    "imgsrc": "/testimonials/img/ahmad-hanan-mustafa.jpg",
    "author": "Ahmad Hanan Mustafa",
    "placed": "Civil Engineering",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "Faculty at CU is best, they have exposure in both academic and industry which enables them to make students learn from a global perspective and what industry requires from a fresher in the field of engineering.",
    "imgsrc": "/testimonials/img/akshita-mathur.jpg",
    "author": "Akshita Mathur",
    "placed": "CSE",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "I am from United Arab Emirates and before joining an Indian University fitting in was my major concern. But, I was surprised with the cultural diversity CU offers, my classmates are from Chennai, Goa, Bangalore and in fact lot of international students. Also, the management is very approachable, we can openly discuss any issues we are facing and any suggestion given by students is welcomed.",
    "imgsrc": "/testimonials/img/disha.jpg",
    "author": "Disha",
    "placed": "CSE",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "Mechanical Engineering is all about practical know how, it is imperative for students to learn from the basics to advanced technologies which will change the future of engineering. I personally experienced a difference in the teaching – learning process at CU, emphasis is given on the project based learning more than the subject study in theory.",
    "imgsrc": "/testimonials/img/robin-singla.jpg",
    "author": "Robin Singla",
    "placed": "Mechanical Engineering",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "One of the most interesting activities is the site analysis project, where we visit certain sites that are rich in culture. We are required to analyse and design a building that responds to the activities, cultures and climatic factors, as well as the site context. This really helped us to design structures that are relevant to the site and inspired us in our future designing process.",
    "imgsrc": "/testimonials/img/ravneet-kaur.jpg",
    "author": "Ravneet Kaur",
    "placed": "B.Arch",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "I am really appreciative for the experience in Architecture program. We have lots of hands on experience, program in itself is both informative and fun at the same time. First year onward I never had a dull moment and I have a much better handle on what it actually means to be an architect.",
    "imgsrc": "/testimonials/img/devansh-dube.jpg",
    "author": "Devansh Dube",
    "placed": "B.Arch",
    "rating": 4.9
  },
  {
    "year": 2016,
    "comment": "The experience of learning how to come up with my own designs and build models of them, learning how to sketch analytically. The diversity among students is also another benefit in this program of CU, it really changes the way one looks at the profession.",
    "imgsrc": "/testimonials/img/harshita-rajpal.jpg",
    "author": "Harshita Rajpal",
    "placed": "B.Arch",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "CU offers a right blend of both classroom learning and project work. From the third semester onwards we are exposed to the latest techniques of modern architecture through visits to historic as well as modern sites of architecture wonder. I find myself at the right place at the right time.",
    "imgsrc": "/testimonials/img/punika.jpg",
    "author": "Punika",
    "placed": "B.Arch",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "CU allows students to be involved in live projects which is a great way to enhance skills. It also clears the doubts on the practical aspects of the subject. Hands- on learning is the most exciting for me.",
    "imgsrc": "/testimonials/img/ibadondor-marboh.jpg",
    "author": "Ibadondor Marboh",
    "placed": "B.Arch",
    "rating": 4.5
  },
  {
    "year": 2016,
    "comment": "Chandigarh is architecturally rich city and the fact that CU is in vicinity of The City Beautiful makes studying here much more exciting. We are placed in a spot that offers a great place to learn the modern architecture.",
    "imgsrc": "/testimonials/img/mandeep-singh.jpg",
    "author": "Mandeep Singh",
    "placed": "B.Arch",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "The international partnerships at CU allow us to travel overseas, as an architecture student, traveling and seeing the different designs, artwork, buildings is truly inspirational. I personally love to learn from experience and the fact we have so many opportunities is just amazing!",
    "imgsrc": "/testimonials/img/zainus-darandar.jpg",
    "author": "Zainus Darandar",
    "placed": "B.Arch",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "The financial assistance provided by CU is appreciative. Apart from scholarships, the management helps for additional benefits for deserving candidates.",
    "imgsrc": "/testimonials/img/jasmeet-kaur.jpg",
    "author": "Jasmeet Kaur",
    "placed": "B.Arch",
    "rating": 4.5
  },
  {
    "year": 2016,
    "comment": "I chose this course because it saves one year and the faculty is great. We are given individual attention and the technological resources provided during studies is apt. Apart from studies, their is lot of cultural development, I am learning so much everyday.",
    "imgsrc": "/testimonials/img/sarbjot-kaur.jpg",
    "author": "Sarbjot Kaur",
    "placed": "B.ED.",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "Initially I found language a barrier, but over the period of time I have become quite familiar. I love North India, culture, sense of dressing and off course the dedication of people to help you on every step. It is just an amazing learning experience.",
    "imgsrc": "/testimonials/img/anis.jpg",
    "author": "Anis",
    "placed": "B.ED.",
    "rating": 5
  },
  {
    "year": 2016,
    "comment": "Found this course suitable for me as i always wanted to be a teacher. The curriculum and special training sessions not only groom us to be industry ready but enhances us on personal level.",
    "imgsrc": "/testimonials/img/ravleen-anand.jpg",
    "author": "Ravleen Anand",
    "placed": "B.ED.",
    "rating": 5
  },
  {
    "year": 2015,
    "comment": "I am going to start my career with such a big brand- MICROSOFT, this is due to the great preparation I got at CU. I learnt from world class faculty, was groomed by corporate mentors and enjoyed every minute in campus. CU is undisputable leader that prepares its students for any challenge.",
    "imgsrc": "/testimonials/img/supreme-cheema.jpg",
    "author": "Supreme Cheema, 9 LPA",
    "placed": "Selected in Microsoft",
    "rating": 5
  },
  {
    "year": 2015,
    "comment": "Varied career opportunities, amazing faculty, regular interaction with industry leaders and cosmopolitan student life all this I have got at CU. I am selected in 4 companies with minimum offer of 4 LPA, this won't have been possible without the team effort, guidance and regular grooming for me during the last 4 years at CU. I would personally like to thank the management for creating such a wonderful platform for us Engineers!",
    "imgsrc": "/testimonials/img/ananya.jpg",
    "author": "Ananya Parth, 9 LPA",
    "placed": "Selected in Microsoft",
    "rating": 4.9
  },
  {
    "year": 2015,
    "comment": "Passion is what makes an engineer successful one but what matters the most is right education institute which fuels that passion. I have experienced a unique edge as an engineer at CU, latest techniques, emerging technologies, best infrastructure and faculty which understands individual needs, available all under one umbrella. I stand proud and excited to start my journey as an engineer in one of the Top MNC's. ",
    "imgsrc": "/testimonials/img/yashwant-verma.jpg",
    "author": "Yashwant Verma, 8.5 LPA",
    "placed": "Selected in PayU",
    "rating": 5
  },
  {
    "year": 2015,
    "comment": "I can describe my journey at CU in one word - Amazing! Culturally diverse community, opportunities to explore the world, interaction with intellectual minds and not to forget co-curricular activities that keeps you on your toes; all this has instilled confidence and achievers attitude in me. I have been selected in 3 companies and what makes it more interesting is that all of them were on my dream list. I am looking forward to my journey in the professional world.",
    "imgsrc": "/testimonials/img/jamandeep-singh.jpg",
    "author": "Jamandeep Singh, 7.2 LPA",
    "placed": "Selected in Cubastion",
    "rating": 4.7
  },
  {
    "year": 2015,
    "comment": "I got placed in Think &amp; Learn, I give credit to my parents, teachers and training department. I loved every moment at CU, be it the project work or expert sessions, CU gives many opportunities for experiential learning.1 am thankful to management for such good opportunities.",
    "imgsrc": "/testimonials/img/sarabjit-singh.jpg",
    "author": "Sarabjit Singh, 6 LPA",
    "placed": "Selected in Think &amp; Learn",
    "rating": 4.5
  },
  {
    "year": 2015,
    "comment": "Getting placed in good company with good package is a concern for every student. But a balanced approach of academics and co-curricular activities is essential. I am starting my professional journey in reputed organization and as a confident person. ",
    "imgsrc": "/testimonials/img/sandeep-kaur.jpg",
    "author": "Harjeet Kaur Virk, 9.5 LPA",
    "placed": "Selected in &#8203;Gwynniebee",
    "rating": 5
  },
  {
    "year": 2015,
    "comment": "I kept searching number of institutes to take admission in computer science engineering and I found Chandigarh University which is in vicinity of Chandigarh, an amazing city to live in. I am happy that I chose to do engineering st CU as it has all the facilities, infrastructure, quality faculty and best placements.",
    "imgsrc": "/testimonials/img/asmin-bhujel.jpg",
    "author": "Asmin Bhujel, Nepal",
    "placed": "Computer Science &amp; Engineering",
    "rating": 4.9
  },
  {
    "year": 2015,
    "comment": "My experience is good. I must say. People are really friendly and faculty is really supportive. What made me choose to do engineering at CU is the flexible academics and emphasis on research and project work. As a student I get to choose which direction I want my career to go.",
    "imgsrc": "/testimonials/img/deki.jpg",
    "author": "Deki Lhazom, Bhutan",
    "placed": "Civil Engineering",
    "rating": 5
  },
  {
    "year": 2015,
    "comment": "Life at CU is amazing, what I admire the most is the industry interface provided to us from 1st semester onwards. It’s been almost a year and I already have had expert sessions with IBM, Microsoft, Volvo Eicher, SAP Labs, Tech Mahindra and international guests from leading universities of USA, UK and Germany.",
    "imgsrc": "/testimonials/img/amit-rana.jpg",
    "author": "Amit Rana, Bihar",
    "placed": "Mechanical Engineering",
    "rating": 4.5
  },
  {
    "year": 2015,
    "comment": "I chose Chandigarh University because of its placements, my seniors have got multiple offers and some of them have offer letters from up to 7 companies. It is amazing to see how Chandigarh University management brings Top MNCs to the campus for placements is offering packages of 22.5 lacs and 24 lacs per annum.",
    "imgsrc": "/testimonials/img/Divya.jpg",
    "author": "Divya, Himachal Pradesh",
    "placed": "Computer Science &amp; Engineering",
    "rating": 5
  },
  {
    "year": 2015,
    "comment": "What I like the most is the faculty at the university, they understand the difficulties I face being a non-Indian student and give support at any time I need it. Also I have made lot of friend’s from various countries and it really is helping me expand my horizons.",
    "imgsrc": "/testimonials/img/Nirvan-Gurunh.jpg",
    "author": "Nirvan Gurunh, Kathmandu",
    "placed": "Computer Science and Engineering",
    "rating": 5
  },
  {
    "year": 2015,
    "comment": "It’s been my dream to become a Civil engineer, I chose India because it has lot of opportunities and Chandigarh is a beautiful city to live in. Chandigarh University is the best university in the vicinity of the city and offers right mix of personal and professional growth. In the time I have spent here, I found management puts lots of efforts in bringing the best of the opportunities for its students.",
    "imgsrc": "/testimonials/img/Grant-Njavwa.jpg",
    "author": "Grant Njavwa, Zambia",
    "placed": "Civil Engineering",
    "rating": 5
  },
  {
    "year": 2015,
    "comment": "Chandigarh University offers both personal &amp; professional growth, regular technical and professional growth, regular technical and cultural events has kept us on our toes. I am exploiting my hidden potential as a theatre artist and it amazes me that I have missed on it for years. Grooming at CU is amazing, I am improving my communication &amp; presentation skills and learning something new every day.",
    "imgsrc": "/testimonials/img/Pibon-Gogoi.jpg",
    "author": "Plabon Gogoi, Assam",
    "placed": "CSE- IBM",
    "rating": 4.9
  },
  {
    "year": 2015,
    "comment": "You know how they say Successfuljourneybeginswithsinglestep,    my big and evidently right step was taking admission in Chandigarh University. I got an excellent learning platform. The course work here is made to suit the needs of emerging industries and global market. This unique learning experience makes me stand out from thecrowd.",
    "imgsrc": "/testimonials/img/aman-singh.jpg",
    "author": "Aman Singh, Haryana",
    "placed": "Computer Science &amp; Engineering",
    "rating": 5
  },
  {
    "year": 2015,
    "comment": "I am very thankful to Chandigarh University, both the Faculty and TPP Department. TPP department conducted many tests like CU-CAT and AMCAT for the students.    I feel proud to be part of such esteemed organization and I am proud to get placed Cognizant and I dedicate my this achievement to my parents and Chandigarh University      ",
    "imgsrc": "/testimonials/img/Abhishek-Pathanaia.jpg",
    "author": "Abhishek Pathanaia",
    "placed": " Electronics Communication Engineering Cognizant",
    "rating": 5
  },
  {
    "year": 2015,
    "comment": "Value addition in terms of education and raising my bar for placements in terms of top ranked companies &amp; salary package could have been possible due to practical-learning approach at CU. Personal attention by experienced faculty and emphasis on lab work makes Chandigarh University class apart from other institutions. CU has truly been ranked as Asia's fastest growing university and I am proud to be one of its students.",
    "imgsrc": "/testimonials/img/Aditi-Priya.jpg",
    "author": "Aditi Priya",
    "placed": " Electronics Communication Engineering Cognizant, Mindtree",
    "rating": 5
  },
  {
    "year": 2015,
    "comment": "In Chandigarh University, faculty members identify the innate capabilities and talents of the students and polish them with their expertise, making students' corporate ready even before they graduate. The University has given a platform to grow, innovate &amp; learn. Today, I am what Chandigarh University made me.    The placement and training department play a vital role to explore your inner self so that you got placed in not only good but best company according to your capabilities and skills.      ",
    "imgsrc": "/testimonials/img/Alisha-Thapar.jpg",
    "author": "Alisha Thapar",
    "placed": " Electronics Communication Engineering Cognizant ",
    "rating": 4.9
  },
  {
    "year": 2015,
    "comment": "Chandigarh University gives a great opportunity for students to broaden their knowledge beyond their field of studies within an international multicultural environment. I am and always will be glad to be the part of this vibrant world with excellent infrastructure, cooperative faculty and best learning environment attracting the big recruiters every year.",
    "imgsrc": "/testimonials/img/Amanjot-Kaur.jpg",
    "author": "Amanjot Kaur",
    "placed": " Electronics Communication Engineering IBM",
    "rating": 5
  },
  {
    "year": 2015,
    "comment": "I feel lucky to be the part of CHANDIGARH UNIVERSITY. It has provided us the platform to get placed in one of the top MNC’s, once we had dream of.  It has been possible through dedicated team of experts conducts Regular Employability Test through AM-CAT, simulated GD, Extempore, Personal Interview sessions with the students before assessing and preparing them for Campus Placements.",
    "imgsrc": "/testimonials/img/Amardeep-Kaur.jpg",
    "author": "Amardeep Kaur",
    "placed": " Electronics Communication Engineering WIPRO, COGNIZANT",
    "rating": 4.5
  },
  {
    "year": 2015,
    "comment": "Chandigarh University provides students with the best opportunities to groom themselves with their studies and enhance their careers. The University provides best education facilities to the students. It has world-class infrastructure and all the classes are well equipped with projectors. All the labs and workshops are well equipped.   My experience in the University has been very good. I have gained good education experience from the University. Teachers have been very cooperative and helping for the placements.      ",
    "imgsrc": "/testimonials/img/Chetan.jpg",
    "author": "Chetan",
    "placed": " Electronics Communication Engineering Deloitte, MuSigma, IBM, Cognizant &amp; Wipro",
    "rating": 4.5
  },
  {
    "year": 2015,
    "comment": "I feel very lucky to be the part of CHANDIGARH UNIVERSITY as it has provided us with many opportunities. The dream to be placed in top notch Multi-National just got real for us in Chandigarh University we never thought of.    The Pre-Placement Training at CU that included AMCAT tests &amp; mock interviews incorporated along with academics from day one boosted my confidence to face MNC’s selection process.      ",
    "imgsrc": "/testimonials/img/Devi-Gurung.jpg",
    "author": "Devi Gurung",
    "placed": " Electronics Communication Engineering Artech Infosystem Pvt.Ltd",
    "rating": 5
  },
  {
    "year": 2015,
    "comment": "I am proud to say that I got my placement as an Associate Technical Operation at IBM-GTS. I believe that there exists a determination and moral support to achieve an initial step of something best in life. The former part is within ourselves and for the latter part; there are the people who provide us with utmost help for which, I would like to thank the Training &amp; Placement Department, Chandigarh University.",
    "imgsrc": "/testimonials/img/Aashish.jpg",
    "author": "Aashish Jacob",
    "placed": " Electronics Communication Engineering IBM",
    "rating": 4.7
  },
  {
    "year": 2015,
    "comment": "Sincere efforts and hard work of faculty provided me gateway to my career by preparing me to get placed in multiple companies. I give credit of my success to my teachers whose guidance at every step helped me to polish my skills. Special classes were organized to bring best out of us, which helped me in getting multiple offer letters. My special thanks to all members of TPP staff who work day and night to achieve wonderful results.",
    "imgsrc": "/testimonials/img/Vikramjeet-Singh.jpg",
    "author": "Vikramjeet Singh",
    "placed": " Electronics Communication Engineering Wipro, IBM, Mu-Sigma",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "Working with Tech-Mahindra was always what I used to dream of while studying. Tech-Mahindra established IMS Academy at Chandigarh University Campus which was north India’s 1st IMS Academy that trained us in emerging technologies which led to my placement in the company.",
    "imgsrc": "/testimonials/img/jasleen.jpg",
    "author": "Jasleen",
    "placed": "Tech-Mahindra, Batch2014",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "The Pre-Placement Training at CU that included AMCAT tests &amp; mock interviews incorporated along with academics from day one boosted my confidence to face MNCs selection process. It also helped me in getting selected by one of my dream company Hewlett Packard.",
    "imgsrc": "/testimonials/img/gurpreet-kaur.jpg",
    "author": "Gurpreet Kaur",
    "placed": "Capgemini, Batch2014",
    "rating": 4.9
  },
  {
    "year": 1,
    "comment": "Value addition in terms of Education and raising my bar for placements in terms of top ranked companies &amp; salary package could have been possible due to practical-learning approach at CU. Personal attention by experienced faculty and emphasis on lab work makes Chandigarh University class apart from other institutions.",
    "imgsrc": "/testimonials/img/mohit.jpg",
    "author": "Mohit Aneja",
    "placed": "iGate, Batch2014",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "Learn to innovate is what we have been asked to by our teachers at CU. I attribute my success during campus placements to hard work Bourne by my faculty and Training &amp; Placement department at CU. I advise my fellow juniors to give proper attention to Pre-placement training as that could make the final difference",
    "imgsrc": "/testimonials/img/Ansari.jpg",
    "author": "Mohd. Danish Ansari",
    "placed": "Atos, Batch2014",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "As a Mechanical Engineering student, I always wanted to work for core engineering company. Due to strong industry liaisoning, top notch companies for Mechanical visited CU for campus placements. I got opportunity to sit for placement drives of Samsung, Jindal Steel and Tata Power and finally got selected by one of them.",
    "imgsrc": "/testimonials/img/kulbir.jpg",
    "author": "Kulbir Singh",
    "placed": "L &amp; T, Batch2014",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "My stay at CU has been great and so was the placement session for my batch. It was hard to believe my luck that companies with such good packages were conducting placement drives for us. I feel blessed to be a student of CU.",
    "imgsrc": "/testimonials/img/mohit-k.jpg",
    "author": "Mohit Kumar",
    "placed": "Wipro, Batch2014",
    "rating": 4.5
  },
  {
    "year": 1,
    "comment": "Holding an offer letter with package of Rs. 14.4 lacs and that too before completing my education was a fairy tale for me when I was doing diploma. But at Chandigarh University, I can proudly say that it is very much possible. State-of-the-art infrastructure and learning new technologies is what Chandigarh University stands for.",
    "imgsrc": "/testimonials/img/abhinav.jpg",
    "author": "Abhinav  Wangi",
    "placed": "Management Shipping, Batch2014",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "CU is not just a university; it is the epitome of learning where students fulfil their dreams, overcome fears and weaknesses to step into the world as smart and confident professionals. It is just not a place to earn the qualification or a degree but to be groomed holistically. CU nurtures talent.",
    "imgsrc": "/testimonials/img/prerna.jpg",
    "author": "Prerna Mahajan",
    "placed": "Cognizant, Batch2014",
    "rating": 4.5
  },
  {
    "year": 1,
    "comment": "CU played a vital role in making me corporate ready. The values inculcated in me by at CU would help me immensely in Corporate and Personal life. We learned a lot at R&amp;D labs (IBM Lab for emerging Technologies) established at university campus, while working on industry sponsored projects. ",
    "imgsrc": "/testimonials/img/ruchi.jpg",
    "author": "Ruchi",
    "placed": "Mdocs, Batch2014",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "CU offers a pool of opportunities to its students; one has to use those opportunities to enhance their abilities. CU helped me identify me latent potential and helped me have a wider horizon. I am grateful to all the faculty members and mentors at University for being so supportive.” CU has truly been ranked as Asia's fastest growing university and I am proud to be one of its students. ",
    "imgsrc": "/testimonials/img/prabhjot.jpg",
    "author": "Prabhjot Kaur",
    "placed": "MedEntry, Batch2014",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "I'm indebted to CU for lot of things, but mostly, I'm grateful for the exposure it has given me. In the three years I've been in CU, I have had numerous opportunities to grow and better myself. I attended plenty of conferences and workshops among which has developed me as a thorough professional.",
    "imgsrc": "/testimonials/img/kanika.jpg",
    "author": "Kanika Garg",
    "placed": "Delloit, Batch2014",
    "rating": 4.5
  },
  {
    "year": 1,
    "comment": "In Chandigarh University, faculty members identify the innate capabilities and talents of the students and polish them with their expertise, making students corporate ready even before they graduate. The University have given a platform to grow, innovate &amp; learn. Today, I am what Chandigarh University made me.",
    "imgsrc": "/testimonials/img/navpreet.jpg",
    "author": "Navpreet Singh",
    "placed": "Cognizant, Batch2014",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "Four years at Univers-ity Institute of Engineer-ing (UIE) at Chandigarh University were undoubtedly one of the best years of my life. When I look back now, I realize how Chandigarh University helped me to shape my personality, infused self-confidence and made me ready to face the professional world. Experiential learning and constant mentoring by subject expert has given me an opportunity to learn, practice and explore new dimensions of emerging technologies.",
    "imgsrc": "/testimonials/img/manvinder.jpg",
    "author": "Manvinder",
    "placed": "Cognizant, Batch2014",
    "rating": 4.8
  },
  {
    "year": 1,
    "comment": "As a student, I have alw-ays been en-couraged to take my practical learning very seriously at CU. Faculty at University has helped me gather and understand topics beyond the scope of syllabus that has helped me during campus placements. The training provided to the students to prepare for selection process is the best and helped me in gaining self-confidence and winner during the company selection process. ",
    "imgsrc": "/testimonials/img/agrima.jpg",
    "author": "Agrima Singhal",
    "placed": "Polaris, Batch2014",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "Microsoft is the world’s leading Software MNC and every computer science engineer’s ultimate work destination. I consider myself lucky to be a student of Chandigarh University that I have got this golden opportunity. As a girl, my parents are proud of me and I am proud of Chandigarh University.",
    "imgsrc": "/testimonials/img/Akanksha.jpg",
    "author": "Akanksha",
    "placed": "Microsoft, Batch2014",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "Life in CU has been a breath taking experience. As a hosteller, I would say it is actually a “Home away from Home”. All the Faculty members, mentors and everyone in CU family have been a great help and a strong support. This place has immensely added to my persona and I will always cherish the memories I shared with this place.",
    "imgsrc": "/testimonials/img/Umar.jpg",
    "author": "Umar",
    "placed": "Microsoft, Batch2014",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "Working with Microsoft was always what I used to dream of while studying. Microsoft choose only 5 Universities all over India for campus placements under their GTSC program and Chandigarh University was the only campus selected for placement process in North India. Chandigarh University made my dream turn into reality.",
    "imgsrc": "/testimonials/img/Rupantar.jpg",
    "author": "Rupantar",
    "placed": "Microsoft, Batch2014",
    "rating": 4.9
  },
  {
    "year": 1,
    "comment": "From an average student to a proficient professional taking on new challe-nging assignments almost every day, CU has completely transformed my personality during my four years of academic pursuit in CU &amp; has given wings to my dreams. I owe my success to my faculty, my mentors in University &amp; parents who made the right decision to choose CU for me.",
    "imgsrc": "/testimonials/img/gagan.jpg",
    "author": "Gagandeep Kaur",
    "placed": "Microsoft, Batch2014",
    "rating": 4.5
  },
  {
    "year": 1,
    "comment": "The 'CU Experience' has been unique and enriching. The environment not only helps us in imbibing knowledge but also in developing our overall personality. In a competitive atmosphere one learns to strive to be the best in every field. The course modules are industry oriented and drill into us problem solving capabilities.",
    "imgsrc": "/testimonials/img/karan.jpg",
    "author": "Karanbir Singh Pannu",
    "placed": "Microsoft, Batch2014",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "After moving to Chandigarh University, I found myself in a totally new environment which encouraged learning and thinking. The faculty and peer groups helped me overcome my reservations against being in a new region and now I look forward to a period of professional learning &amp; personal growth.",
    "imgsrc": "/testimonials/img/abhishek.jpg",
    "author": "Abhishek Anand",
    "placed": "Patna (Bihar)",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "Words are not going to be enough to express my gratitude towards the faculty and administration of Chandigarh University. The friendly atmosphere helped me overcome by apprehensions and through the presence of numerous opportunities, I found myself on the right professional course.",
    "imgsrc": "/testimonials/img/harshdeep.jpg",
    "author": "Harshdeep Singh",
    "placed": "Badarpur (New Delhi)",
    "rating": 4.5
  },
  {
    "year": 1,
    "comment": "The course work here is carefully designed to suit the needs of emerging global markets and industries and the well calculated balance between academics and extra-curricular activities helps in carving the leaders for tomorrow. Innovative teaching methodologies and experienced faculty lead to strong foundation of subject basics which are help full during campus placements. Studying at Chandigarh University &amp; selecting future driven course has been the best decision of my life.",
    "imgsrc": "/testimonials/img/Rishabh.jpg",
    "author": "Rishabh Khare",
    "placed": "Indore (MP)",
    "rating": 4.8
  },
  {
    "year": 1,
    "comment": "The innovative learning process makes me feel quite different from my peers back home, along with imparting me with immense confidence. CU has been a life transforming process.",
    "imgsrc": "/testimonials/img/Pranjal.jpg",
    "author": "Pranjal",
    "placed": "Guwahati (Assam)",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "Chandigarh University's campus is just like a home away from home. Coming from a different social background, the administration, faculty, and students greeted me with warmth &amp; love, thus making the adjustment process relatively quick and easy.",
    "imgsrc": "/testimonials/img/roni.jpg",
    "author": "Roni Ningombam",
    "placed": "Imphal (Manipur)",
    "rating": 4.8
  },
  {
    "year": 1,
    "comment": "My tenure has been enriching and soulful, and numerous extra-curricular activites balanced with academics have helped in my overall development.",
    "imgsrc": "/testimonials/img/nitin.jpg",
    "author": "Nitin Badyal",
    "placed": "Udhampur (Jammu)",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "Chandigarh University has been an experience of a lifetime. The faculty here is particularly knowledg-able and guide us through the path of thinking that leads to innovation which further enlighten us about various career opportunities that are in demand by multinational companies.",
    "imgsrc": "/testimonials/img/kumar.jpg",
    "author": "Kumar Gaurav",
    "placed": "Nalanda (Bihar)",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "CU provides an excellent learning platform for young students along with bridging the gap between talent and opportunities. The academic set up here is not restricted to cramming and encourages us to think out of the box.",
    "imgsrc": "/testimonials/img/ridam.jpg",
    "author": "Ridam Salhotra",
    "placed": "Rohini (Delhi)",
    "rating": 4.9
  },
  {
    "year": 1,
    "comment": "CU provides world class facilities for diverse learning and growth. The faculty is excellent and very supportive. Apart from the unconventional academic setup, a wide spectrum of extra curricular activities continues to engage and enlighten us.",
    "imgsrc": "/testimonials/img/shanu.jpg",
    "author": "Shanu Sharma",
    "placed": "Gurgaon (Haryana)",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "Chandigarh University provides  practical oriented learning approach that helps in understanding the latest and emerging trends available in particular stream. The pre-placement training which begins in first semester itself helps us to prepare ourself for corporate interviews along with our regular studies.",
    "imgsrc": "/testimonials/img/sandeep.jpg",
    "author": "Sandeep Lamichhane",
    "placed": "Sunwal (Nepal)",
    "rating": 4.5
  },
  {
    "year": 1,
    "comment": "Chandigarh University provides ample opportunities to explore new ideas and work on innovative projects so that we are able to implement the learning of our subjects. I am proud to be a part of Fastest Growing Educational Institution through which, I can build my own identity.",
    "imgsrc": "/testimonials/img/virendra.jpg",
    "author": "Virendra Singh",
    "placed": "Ajmer (Rajasthan)",
    "rating": 5
  },
  {
    "year": 1,
    "comment": "Chandigarh University offers an opportunity that prepares the students with all-round development both in academics as well as co-curriculer activities. The environment at university is conducive enough to produce future leaders for Industry. Hostel life at campus is so comfortable that as an outsider I have the feeling of home staying away from home. Facilities like Wi-fi campus, gym, indoor &amp; outdoor sports are available both for boys &amp; girls.",
    "imgsrc": "/testimonials/img/Namgail.jpg",
    "author": "Namgail Dorjay",
    "placed": "Kargil (Ladakh)",
    "rating": 4.5
  },
  {
    "year": 1,
    "comment": "Cherishing my dream of being a success full professional, CU is helping me in learning the latest technologies that are used by Industry. R &amp; D centre at CU is host to India’s most advanced technology labs setup by top notch companies.",
    "imgsrc": "/testimonials/img/Bikalp.jpg",
    "author": "Bikalp Pantha",
    "placed": "Bahairahaua (Nepal)",
    "rating": 4.9
  },
  {
    "year": 1,
    "comment": "The transparent examination and evaluation process at CU is unmatchable with any other university as answer sheets are shown in person to every students so that they are able to check their performance &amp; learn from their mistake.",
    "imgsrc": "/testimonials/img/Pankaj.jpg",
    "author": "Pankaj",
    "placed": "Hyderabad (AP)",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "Engineers play crucial role in Nation Building and Universities play crucial role in making quality engineers who through their work serve society and mankind. I see lot of enthusiasm in students at University campus who will use their skills in making India a developed nation.",
    "imgsrc": "/testimonials/img/abdul-kalam.jpg",
    "author": "Dr. APJ Abdul Kalam",
    "placed": "Former President of India",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "Innovation in education is what Chandigarh University is doing and the enthusiasm of the university team will bring a positive change certainly. The layout of University is very good full of greenery and vibrant with new ideas.",
    "imgsrc": "/testimonials/img/shivraj-patil.jpg",
    "author": "Shivraj Patil",
    "placed": "Former Governor of Punjab",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "IBM is proud to be associated with CU &amp; the result of collaboration has resulted in establishment of India’s 1st IBM Lab for Emerging Technologies that will offer advanced learning for Engineering &amp; Management. The University campus is one of the best that I have visited &amp; with the long term vision of management, the students have bright future ahead.",
    "imgsrc": "/testimonials/img/ibm.jpg",
    "author": "Mr. Karthik Padmanabhan",
    "placed": "IBM India",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "CU proved that private universities can do wonders in terms of infrastructure and offering courses in emerging areas. Offering specialized Engineering programs like Automobiles and Petroleum is some of path breaking steps towards creating a pool of engineers that India requires and Chandigarh University should be appreciated for that.",
    "imgsrc": "/testimonials/img/ongc.jpg",
    "author": "Dr. Neelima Yadav",
    "placed": "ONGC",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "CU has established one of the advanced &amp; beautiful campuses in North India which has grown exponentially within just 2 years. Projects like Moon Buggey and Human-Powered Vehicle developed by students at CU shows the strong foundation of Research that has been inculcated among them so that they are ready for Industry.",
    "imgsrc": "/testimonials/img/volvo.jpg",
    "author": "Mr. Amanpreet Singh Bhatia",
    "placed": "Volvo-Eicher",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "I am quite impressed with the infrastructure at CU, especially the extent to which Industry has been made a partner to groom students. The development of Academia-Industry relationship &amp; focus on the Industry requirements is praise-worthy &amp; we as an Industry have discussed to strengthen our relationship with varisty in future.",
    "imgsrc": "/testimonials/img/google.jpg",
    "author": "Ms. Shwetambri Nath</span>",
    "placed": "Google India",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "Faculty is the core strength of any University and Chandigarh University has brought up this strength very well. With lots of Ph.D. faculty members in the team of faculty at CU, I think that students are learning under the right guidance and I hope that CU will produce some of the best futuristic leaders of tomorrow.",
    "imgsrc": "/testimonials/img/dr-cheema.jpg",
    "author": "Dr. Daljeet Singh Cheema",
    "placed": "Education Minister, Government of Punjab",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "We feel proud in partnering with Chandigarh University to help prepare Industry ready Human Resource, especially for IT sector. Tech-Mahindra has selected CU, the 1st in North India to establish IMS Academy that will train &amp; certify the students that can be selected by IT Industry.",
    "imgsrc": "/testimonials/img/tech-mahindra.jpg",
    "author": "Mr. Duraivel A Gopal",
    "placed": "Tech-Mahindra",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "Students of Chandigarh University tend to gain from MoU signed between Birmingham University and CU as they can visit UK for Internship, Semester abroad initiatives and they would be given special preference. The academic model and CGPA system being followed at CU matches as that of some of the best International Universities.",
    "imgsrc": "/testimonials/img/uk.jpg",
    "author": "Dr.Parmit S. Chima",
    "placed": "Birmingham City University, UK",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "I feel delighted to be here at CU &amp; joining hands with them is our honor. The level of students is great &amp; the syllabus which is being taught to them is of International standard &amp; quite advanced. We will be honored if some of the students from CU can visit for their summer training or any advanced studies to our University in UK.",
    "imgsrc": "/testimonials/img/midlesex.jpg",
    "author": "Dr.Michael Driscoll",
    "placed": "Vice Chancellor Middlesex University, UK ",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "While driving into the campus its gives the impression that as if was walking into the University campus which is located on out-skirts of New York or New Jersey area.",
    "imgsrc": "/testimonials/img/arun-k-grover.jpg",
    "author": "Arun K Grover",
    "placed": "Vice Chancellor, Punjab University Chandigarh",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "Its excellent experience, the number of students studying at University is very good and the exponential growth of University in terms of courses offered and studying taking admission here in just 4 years is really praise worthy.",
    "imgsrc": "/testimonials/img/baldev-singh-dhillon.jpg",
    "author": "Baldev Singh Dhillon",
    "placed": "Vice Chancellor, PAU Ludhiana",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "Impressed with the infrastructure and the level of students at Chandigarh University. CU proved me wrong in thinking that Private Universities in India don’t go for excellence. The inter-disciplinary approach at CU where engineering students can study different subjects like law, hotel-management is the best academic approach.",
    "imgsrc": "/testimonials/img/S-Sadagoppan.jpg",
    "author": "S Sadagoppan",
    "placed": "Director, IIIT Banglore",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "Right from deciding the name to its location, everything has been done with thorough study and research. I have been associated with this University since it started, I think it has come up well and the academic model CU is offering matches some of the best universities in India.",
    "imgsrc": "/testimonials/img/kn-pathak.jpg",
    "author": "K N Pathak ",
    "placed": "Former Vice Chancellor, Punjab University Chandigarh",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "We have more than 25 Microsoft Innovation Centres in India and this one at Chandigarh University is the 1st one in North India. I am very excited that CU has invested so much in this centre that can help the students to under-go learning in latest technologies that will ultimately lead to Innovation.",
    "imgsrc": "/testimonials/img/Joseph-Landes.jpg",
    "author": "Joseph Landes",
    "placed": "Microsoft",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "The opening of Wipro Mission 10x Lab is the 1st step of our association with Chandigarh University. We look forward to extend this relationship as we have visited more than 1400 Universities in India under the agenda that more and more students can be trained.",
    "imgsrc": "/testimonials/img/aditya-sharma.jpg",
    "author": "Aditya Sharma",
    "placed": "Wipro",
    "rating": 5
  },
  {
    "year": 0002,
    "comment": "Chandigarh University is truly managed by professionals and academicians that have rich background and experience in conducting research. You have the right seed in terms of man-power and you have the best infrastructure so there is no doubt that CU is heading for academic &amp; research excellence.",
    "imgsrc": "/testimonials/img/Yogesh-Kochhar.jpg",
    "author": "Yogesh Kochhar",
    "placed": "Microsoft",
    "rating": 5
  }
]